---
title: PolymeshFacet
classe: Autodesk.Revit.DB.PolymeshFacet
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# PolymeshFacet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `polymeshFacet.IsValidObject` | Boolean |
| `Int32 V1 { get; }` | `polymeshFacet.V1` | Int32 |
| `Int32 V2 { get; }` | `polymeshFacet.V2` | Int32 |
| `Int32 V3 { get; }` | `polymeshFacet.V3` | Int32 |
| `IList<Int32> GetVertices()` | `polymeshFacet.GetVertices()` | IList<Int32> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```